# Learn Pandas

## Step 1

### Importing Pandas

In [132]:
import pandas as pd

## Step 2

### Series & DataFrame

In [133]:
data = [10, 20, 30, 40]
series = pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
dtype: int64

In [134]:
data = [100, 200, 300, 400]
index_labels = ['a', 'b', 'c', 'd']

series = pd.Series(data, index=index_labels)
print(series)

a    100
b    200
c    300
d    400
dtype: int64

In [135]:
print(series['b'])

200

In [136]:
data_dict = {'Alice': 90, 'Bob': 85, 'Charlie': 95}
series = pd.Series(data_dict)
print(series)

Alice      90
Bob        85
Charlie    95
dtype: int64

In [137]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [138]:
print(df.head())

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [139]:
print(df.tail())

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [140]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes
None

In [141]:
print(df.describe())

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

## Step 3

### Reading & Writing Data

In [142]:
df = pd.read_csv('data.csv')
print(df.head())

   enrollee_id      city  city_development_index gender  \
0         8949  city_103                   0.920   Male
1        29725   city_40                   0.776   Male
2        11561   city_21                   0.624    NaN
3        33241  city_115                   0.789    NaN
4          666  city_162                   0.767   Male

       relevent_experience enrolled_university education_level  \
0  Has relevent experience       no_enrollment        Graduate
1   No relevent experience       no_enrollment        Graduate
2   No relevent experience    Full time course        Graduate
3   No relevent experience                 NaN        Graduate
4  Has relevent experience       no_enrollment         Masters

  major_discipline  experience company_size    company_type  training_hours  \
0             STEM        20.0          NaN             NaN            36.0
1             STEM        15.0        50-99         Pvt Ltd            47.0
2             STEM         5.0          NaN             NaN            83.0
3  Business Degree         0.0          NaN         Pvt Ltd            52.0
4             STEM        20.0        50-99  Funded Startup             8.0

   target
0     1.0
1     0.0
2     0.0
3     1.0
4     0.0

In [143]:
df = pd.read_csv('data.csv', header=None)
print(df)

                0         1                       2       3   \
0      enrollee_id      city  city_development_index  gender
1             8949  city_103                    0.92    Male
2            29725   city_40      0.7759999999999999    Male
3            11561   city_21                   0.624     NaN
4            33241  city_115                   0.789     NaN
...            ...       ...                     ...     ...
19154         7386  city_173                   0.878    Male
19155        31398  city_103                    0.92    Male
19156        24576  city_103                    0.92    Male
19157         5756   city_65                   0.802    Male
19158        23834   city_67                   0.855     NaN

                            4                    5                6   \
0          relevent_experience  enrolled_university  education_level
1      Has relevent experience        no_enrollment         Graduate
2       No relevent experience        no_enrollment         Graduate
3       No relevent experience     Full time course         Graduate
4       No relevent experience                  NaN         Graduate
...                        ...                  ...              ...
19154   No relevent experience        no_enrollment         Graduate
19155  Has relevent experience        no_enrollment         Graduate
19156  Has relevent experience        no_enrollment         Graduate
19157  Has relevent experience        no_enrollment      High School
19158   No relevent experience        no_enrollment   Primary School

                     7           8             9             10  \
0      major_discipline  experience  company_size  company_type
1                  STEM          20           NaN           NaN
2                  STEM          15         50-99       Pvt Ltd
3                  STEM           5           NaN           NaN
4       Business Degree           0           NaN       Pvt Ltd
...                 ...         ...           ...           ...
19154        Humanities          14           NaN           NaN
19155              STEM          14           NaN           NaN
19156              STEM          20         50-99       Pvt Ltd
19157               NaN           0       500-999       Pvt Ltd
19158               NaN           2           NaN           NaN

                   11      12
0      training_hours  target
1                36.0     1.0
2                47.0     0.0
3                83.0     0.0
4                52.0     1.0
...               ...     ...
19154            42.0     1.0
19155            52.0     1.0
19156            44.0     0.0
19157            97.0     0.0
19158           127.0     0.0

[19159 rows x 13 columns]

In [144]:
df = pd.read_csv('data.csv', index_col='city')
print(df)

          enrollee_id  city_development_index gender      relevent_experience  \
city
city_103         8949                   0.920   Male  Has relevent experience
city_40         29725                   0.776   Male   No relevent experience
city_21         11561                   0.624    NaN   No relevent experience
city_115        33241                   0.789    NaN   No relevent experience
city_162          666                   0.767   Male  Has relevent experience
...               ...                     ...    ...                      ...
city_173         7386                   0.878   Male   No relevent experience
city_103        31398                   0.920   Male  Has relevent experience
city_103        24576                   0.920   Male  Has relevent experience
city_65          5756                   0.802   Male  Has relevent experience
city_67         23834                   0.855    NaN   No relevent experience

         enrolled_university education_level major_discipline  experience  \
city
city_103       no_enrollment        Graduate             STEM        20.0
city_40        no_enrollment        Graduate             STEM        15.0
city_21     Full time course        Graduate             STEM         5.0
city_115                 NaN        Graduate  Business Degree         0.0
city_162       no_enrollment         Masters             STEM        20.0
...                      ...             ...              ...         ...
city_173       no_enrollment        Graduate       Humanities        14.0
city_103       no_enrollment        Graduate             STEM        14.0
city_103       no_enrollment        Graduate             STEM        20.0
city_65        no_enrollment     High School              NaN         0.0
city_67        no_enrollment  Primary School              NaN         2.0

         company_size    company_type  training_hours  target
city
city_103          NaN             NaN            36.0     1.0
city_40         50-99         Pvt Ltd            47.0     0.0
city_21           NaN             NaN            83.0     0.0
city_115          NaN         Pvt Ltd            52.0     1.0
city_162        50-99  Funded Startup             8.0     0.0
...               ...             ...             ...     ...
city_173          NaN             NaN            42.0     1.0
city_103          NaN             NaN            52.0     1.0
city_103        50-99         Pvt Ltd            44.0     0.0
city_65       500-999         Pvt Ltd            97.0     0.0
city_67           NaN             NaN           127.0     0.0

[19158 rows x 12 columns]

In [145]:
df = pd.read_csv('data.csv', na_values=['NA', 'N/A', 'Missing'])
print(df)

       enrollee_id      city  city_development_index gender  \
0             8949  city_103                   0.920   Male
1            29725   city_40                   0.776   Male
2            11561   city_21                   0.624    NaN
3            33241  city_115                   0.789    NaN
4              666  city_162                   0.767   Male
...            ...       ...                     ...    ...
19153         7386  city_173                   0.878   Male
19154        31398  city_103                   0.920   Male
19155        24576  city_103                   0.920   Male
19156         5756   city_65                   0.802   Male
19157        23834   city_67                   0.855    NaN

           relevent_experience enrolled_university education_level  \
0      Has relevent experience       no_enrollment        Graduate
1       No relevent experience       no_enrollment        Graduate
2       No relevent experience    Full time course        Graduate
3       No relevent experience                 NaN        Graduate
4      Has relevent experience       no_enrollment         Masters
...                        ...                 ...             ...
19153   No relevent experience       no_enrollment        Graduate
19154  Has relevent experience       no_enrollment        Graduate
19155  Has relevent experience       no_enrollment        Graduate
19156  Has relevent experience       no_enrollment     High School
19157   No relevent experience       no_enrollment  Primary School

      major_discipline  experience company_size    company_type  \
0                 STEM        20.0          NaN             NaN
1                 STEM        15.0        50-99         Pvt Ltd
2                 STEM         5.0          NaN             NaN
3      Business Degree         0.0          NaN         Pvt Ltd
4                 STEM        20.0        50-99  Funded Startup
...                ...         ...          ...             ...
19153       Humanities        14.0          NaN             NaN
19154             STEM        14.0          NaN             NaN
19155             STEM        20.0        50-99         Pvt Ltd
19156              NaN         0.0      500-999         Pvt Ltd
19157              NaN         2.0          NaN             NaN

       training_hours  target
0                36.0     1.0
1                47.0     0.0
2                83.0     0.0
3                52.0     1.0
4                 8.0     0.0
...               ...     ...
19153            42.0     1.0
19154            52.0     1.0
19155            44.0     0.0
19156            97.0     0.0
19157           127.0     0.0

[19158 rows x 13 columns]

In [146]:
df.to_csv('output.csv', index=False)

In [147]:
df = pd.read_excel('data.xlsx')
print(df)

     client_id                     full_name  age        gender  \
0            1  Герасим Владиленович Тихонов   76       Мужской
1            2     Соболева Марфа Дмитриевна   68       Женский
2            3     Новикова Кира Геннадьевна   75       Мужской
3            4   Кудрявцев Измаил Федосеевич   40       Мужской
4            5    Ангелина Аркадьевна Лапина   64       Женский
..         ...                           ...  ...           ...
220        221      Харитон Марсович Новиков   27       Мужской
221        222        Юдина Иванна Андреевна   36       Женский
222        223  Афанасьев Творимир Вилорович   43  Неразрешимый
223        224     Юлия Николаевна Артемьева   23       Мужской
224        225      Потапов Гедеон Абрамович   92       Мужской

     deposit_amount  interest_rate deposit_date                        email  \
0            444.00           7.33   2024-05-08      fokinvladlen@zhukova.ru
1         141271.96           6.68   2024-10-26  birjukovvenedikt@rambler.ru
2         373703.30           3.24   2024-01-19           pimen_1995@npo.biz
3         271911.53           5.65   2024-02-18             serafim47@npo.ru
4         324092.48           7.87   2023-12-22        stepanovamaja@rao.net
..              ...            ...          ...                          ...
220       561129.93          21.63   2024-03-24       uljana1989@hotmail.com
221      1823607.79           2.64   2024-01-29           polina29@yandex.ru
222       683894.54           3.20   2024-10-06     morozovnikodim@gmail.com
223       323559.59          14.98   2023-03-17         nina1974@hotmail.com
224      1960813.33          15.47   2020-02-21      narkis_1994@shneder.biz

      phone_number    account_type  branch_location  is_active
0    7543802895836         Текущий  Санкт-Петербург       True
1    7020708166798         Текущий           Москва      False
2    7331081529784         Текущий     Екатеринбург      False
3    7798771280631  Сберегательный           Казань      False
4    7525444647270         Текущий      Новосибирск      False
..             ...             ...              ...        ...
220  7485554892063  Сберегательный        Краснодар       True
221  7203530658954  Индивидуальный        Краснодар      False
222  7240799594128      Депозитный          Воронеж       True
223  7873979856776      Депозитный          Воронеж      False
224  7743929020470      Депозитный          Воронеж      False

[225 rows x 12 columns]

In [148]:
df = pd.read_excel('data.xlsx', sheet_name='Sheet1')
print(df)

     client_id                     full_name  age        gender  \
0            1  Герасим Владиленович Тихонов   76       Мужской
1            2     Соболева Марфа Дмитриевна   68       Женский
2            3     Новикова Кира Геннадьевна   75       Мужской
3            4   Кудрявцев Измаил Федосеевич   40       Мужской
4            5    Ангелина Аркадьевна Лапина   64       Женский
..         ...                           ...  ...           ...
220        221      Харитон Марсович Новиков   27       Мужской
221        222        Юдина Иванна Андреевна   36       Женский
222        223  Афанасьев Творимир Вилорович   43  Неразрешимый
223        224     Юлия Николаевна Артемьева   23       Мужской
224        225      Потапов Гедеон Абрамович   92       Мужской

     deposit_amount  interest_rate deposit_date                        email  \
0            444.00           7.33   2024-05-08      fokinvladlen@zhukova.ru
1         141271.96           6.68   2024-10-26  birjukovvenedikt@rambler.ru
2         373703.30           3.24   2024-01-19           pimen_1995@npo.biz
3         271911.53           5.65   2024-02-18             serafim47@npo.ru
4         324092.48           7.87   2023-12-22        stepanovamaja@rao.net
..              ...            ...          ...                          ...
220       561129.93          21.63   2024-03-24       uljana1989@hotmail.com
221      1823607.79           2.64   2024-01-29           polina29@yandex.ru
222       683894.54           3.20   2024-10-06     morozovnikodim@gmail.com
223       323559.59          14.98   2023-03-17         nina1974@hotmail.com
224      1960813.33          15.47   2020-02-21      narkis_1994@shneder.biz

      phone_number    account_type  branch_location  is_active
0    7543802895836         Текущий  Санкт-Петербург       True
1    7020708166798         Текущий           Москва      False
2    7331081529784         Текущий     Екатеринбург      False
3    7798771280631  Сберегательный           Казань      False
4    7525444647270         Текущий      Новосибирск      False
..             ...             ...              ...        ...
220  7485554892063  Сберегательный        Краснодар       True
221  7203530658954  Индивидуальный        Краснодар      False
222  7240799594128      Депозитный          Воронеж       True
223  7873979856776      Депозитный          Воронеж      False
224  7743929020470      Депозитный          Воронеж      False

[225 rows x 12 columns]

In [149]:
df = pd.read_excel('data.xlsx', index_col='is_active')
print(df)

           client_id                     full_name  age        gender  \
is_active
True               1  Герасим Владиленович Тихонов   76       Мужской
False              2     Соболева Марфа Дмитриевна   68       Женский
False              3     Новикова Кира Геннадьевна   75       Мужской
False              4   Кудрявцев Измаил Федосеевич   40       Мужской
False              5    Ангелина Аркадьевна Лапина   64       Женский
...              ...                           ...  ...           ...
True             221      Харитон Марсович Новиков   27       Мужской
False            222        Юдина Иванна Андреевна   36       Женский
True             223  Афанасьев Творимир Вилорович   43  Неразрешимый
False            224     Юлия Николаевна Артемьева   23       Мужской
False            225      Потапов Гедеон Абрамович   92       Мужской

           deposit_amount  interest_rate deposit_date  \
is_active
True               444.00           7.33   2024-05-08
False           141271.96           6.68   2024-10-26
False           373703.30           3.24   2024-01-19
False           271911.53           5.65   2024-02-18
False           324092.48           7.87   2023-12-22
...                   ...            ...          ...
True            561129.93          21.63   2024-03-24
False          1823607.79           2.64   2024-01-29
True            683894.54           3.20   2024-10-06
False           323559.59          14.98   2023-03-17
False          1960813.33          15.47   2020-02-21

                                 email   phone_number    account_type  \
is_active
True           fokinvladlen@zhukova.ru  7543802895836         Текущий
False      birjukovvenedikt@rambler.ru  7020708166798         Текущий
False               pimen_1995@npo.biz  7331081529784         Текущий
False                 serafim47@npo.ru  7798771280631  Сберегательный
False            stepanovamaja@rao.net  7525444647270         Текущий
...                                ...            ...             ...
True            uljana1989@hotmail.com  7485554892063  Сберегательный
False               polina29@yandex.ru  7203530658954  Индивидуальный
True          morozovnikodim@gmail.com  7240799594128      Депозитный
False             nina1974@hotmail.com  7873979856776      Депозитный
False          narkis_1994@shneder.biz  7743929020470      Депозитный

           branch_location
is_active
True       Санкт-Петербург
False               Москва
False         Екатеринбург
False               Казань
False          Новосибирск
...                    ...
True             Краснодар
False            Краснодар
True               Воронеж
False              Воронеж
False              Воронеж

[225 rows x 11 columns]

In [150]:
df.to_excel('output.xlsx',index=False)

In [151]:
df.to_excel('output.xlsx', sheet_name='ProcessedData', index=False)

## Step 4

### Selecting & Indexing Data

In [152]:
data = pd.read_csv('data.csv')
print(data)

       enrollee_id      city  city_development_index gender  \
0             8949  city_103                   0.920   Male
1            29725   city_40                   0.776   Male
2            11561   city_21                   0.624    NaN
3            33241  city_115                   0.789    NaN
4              666  city_162                   0.767   Male
...            ...       ...                     ...    ...
19153         7386  city_173                   0.878   Male
19154        31398  city_103                   0.920   Male
19155        24576  city_103                   0.920   Male
19156         5756   city_65                   0.802   Male
19157        23834   city_67                   0.855    NaN

           relevent_experience enrolled_university education_level  \
0      Has relevent experience       no_enrollment        Graduate
1       No relevent experience       no_enrollment        Graduate
2       No relevent experience    Full time course        Graduate
3       No relevent experience                 NaN        Graduate
4      Has relevent experience       no_enrollment         Masters
...                        ...                 ...             ...
19153   No relevent experience       no_enrollment        Graduate
19154  Has relevent experience       no_enrollment        Graduate
19155  Has relevent experience       no_enrollment        Graduate
19156  Has relevent experience       no_enrollment     High School
19157   No relevent experience       no_enrollment  Primary School

      major_discipline  experience company_size    company_type  \
0                 STEM        20.0          NaN             NaN
1                 STEM        15.0        50-99         Pvt Ltd
2                 STEM         5.0          NaN             NaN
3      Business Degree         0.0          NaN         Pvt Ltd
4                 STEM        20.0        50-99  Funded Startup
...                ...         ...          ...             ...
19153       Humanities        14.0          NaN             NaN
19154             STEM        14.0          NaN             NaN
19155             STEM        20.0        50-99         Pvt Ltd
19156              NaN         0.0      500-999         Pvt Ltd
19157              NaN         2.0          NaN             NaN

       training_hours  target
0                36.0     1.0
1                47.0     0.0
2                83.0     0.0
3                52.0     1.0
4                 8.0     0.0
...               ...     ...
19153            42.0     1.0
19154            52.0     1.0
19155            44.0     0.0
19156            97.0     0.0
19157           127.0     0.0

[19158 rows x 13 columns]

### Selecting Columns

In [153]:
df = pd.DataFrame(data)
print(df['enrollee_id'])

0         8949
1        29725
2        11561
3        33241
4          666
         ...
19153     7386
19154    31398
19155    24576
19156     5756
19157    23834
Name: enrollee_id, Length: 19158, dtype: int64

In [154]:
print(df['city'])

0        city_103
1         city_40
2         city_21
3        city_115
4        city_162
           ...
19153    city_173
19154    city_103
19155    city_103
19156     city_65
19157     city_67
Name: city, Length: 19158, dtype: object

### Selecting Multiple Columns

In [155]:
df_subset = df[['enrollee_id' , 'city' , 'gender']]
print(df_subset)

       enrollee_id      city gender
0             8949  city_103   Male
1            29725   city_40   Male
2            11561   city_21    NaN
3            33241  city_115    NaN
4              666  city_162   Male
...            ...       ...    ...
19153         7386  city_173   Male
19154        31398  city_103   Male
19155        24576  city_103   Male
19156         5756   city_65   Male
19157        23834   city_67    NaN

[19158 rows x 3 columns]

### Selecting Rows

### Selecting Rows by Index using .loc[]

In [156]:
print(df.loc[1])

enrollee_id                                29725
city                                     city_40
city_development_index                     0.776
gender                                      Male
relevent_experience       No relevent experience
enrolled_university                no_enrollment
education_level                         Graduate
major_discipline                            STEM
experience                                  15.0
company_size                               50-99
company_type                             Pvt Ltd
training_hours                              47.0
target                                       0.0
Name: 1, dtype: object

### Selecting Rows by Position using .iloc[]

In [157]:
print(df.iloc[1])

enrollee_id                                29725
city                                     city_40
city_development_index                     0.776
gender                                      Male
relevent_experience       No relevent experience
enrolled_university                no_enrollment
education_level                         Graduate
major_discipline                            STEM
experience                                  15.0
company_size                               50-99
company_type                             Pvt Ltd
training_hours                              47.0
target                                       0.0
Name: 1, dtype: object

### Selecting Multiple Rows

In [158]:
print(df.loc[[0 , 3]])

   enrollee_id      city  city_development_index gender  \
0         8949  city_103                   0.920   Male
3        33241  city_115                   0.789    NaN

       relevent_experience enrolled_university education_level  \
0  Has relevent experience       no_enrollment        Graduate
3   No relevent experience                 NaN        Graduate

  major_discipline  experience company_size company_type  training_hours  \
0             STEM        20.0          NaN          NaN            36.0
3  Business Degree         0.0          NaN      Pvt Ltd            52.0

   target
0     1.0
3     1.0

In [159]:
print(df.iloc[0:3])

   enrollee_id      city  city_development_index gender  \
0         8949  city_103                   0.920   Male
1        29725   city_40                   0.776   Male
2        11561   city_21                   0.624    NaN

       relevent_experience enrolled_university education_level  \
0  Has relevent experience       no_enrollment        Graduate
1   No relevent experience       no_enrollment        Graduate
2   No relevent experience    Full time course        Graduate

  major_discipline  experience company_size company_type  training_hours  \
0             STEM        20.0          NaN          NaN            36.0
1             STEM        15.0        50-99      Pvt Ltd            47.0
2             STEM         5.0          NaN          NaN            83.0

   target
0     1.0
1     0.0
2     0.0

### Filtering Data

### Filtering Rows Based on a Condition

In [160]:
filtered_df = df[df['gender'] == 'Male']
print(filtered_df)

       enrollee_id      city  city_development_index gender  \
0             8949  city_103                   0.920   Male
1            29725   city_40                   0.776   Male
4              666  city_162                   0.767   Male
6            28806  city_160                   0.920   Male
7              402   city_46                   0.762   Male
...            ...       ...                     ...    ...
19151        11385  city_149                   0.689   Male
19153         7386  city_173                   0.878   Male
19154        31398  city_103                   0.920   Male
19155        24576  city_103                   0.920   Male
19156         5756   city_65                   0.802   Male

           relevent_experience enrolled_university education_level  \
0      Has relevent experience       no_enrollment        Graduate
1       No relevent experience       no_enrollment        Graduate
4      Has relevent experience       no_enrollment         Masters
6      Has relevent experience       no_enrollment     High School
7      Has relevent experience       no_enrollment        Graduate
...                        ...                 ...             ...
19151   No relevent experience    Full time course        Graduate
19153   No relevent experience       no_enrollment        Graduate
19154  Has relevent experience       no_enrollment        Graduate
19155  Has relevent experience       no_enrollment        Graduate
19156  Has relevent experience       no_enrollment     High School

      major_discipline  experience company_size    company_type  \
0                 STEM        20.0          NaN             NaN
1                 STEM        15.0        50-99         Pvt Ltd
4                 STEM        20.0        50-99  Funded Startup
6                  NaN         5.0        50-99  Funded Startup
7                 STEM        13.0          <10         Pvt Ltd
...                ...         ...          ...             ...
19151              NaN         2.0          NaN             NaN
19153       Humanities        14.0          NaN             NaN
19154             STEM        14.0          NaN             NaN
19155             STEM        20.0        50-99         Pvt Ltd
19156              NaN         0.0      500-999         Pvt Ltd

       training_hours  target
0                36.0     1.0
1                47.0     0.0
4                 8.0     0.0
6                24.0     0.0
7                18.0     1.0
...               ...     ...
19151            60.0     0.0
19153            42.0     1.0
19154            52.0     1.0
19155            44.0     0.0
19156            97.0     0.0

[13221 rows x 13 columns]

### Filtering with Multiple Conditions

In [162]:
df_filtered = df[(df['gender'] == 'Male') & (df['city'] == 'city_40')]
print(df_filtered)

       enrollee_id     city  city_development_index gender  \
1            29725  city_40                   0.776   Male
23            7041  city_40                   0.776   Male
363          28229  city_40                   0.776   Male
461          18620  city_40                   0.776   Male
827           1783  city_40                   0.776   Male
998          29671  city_40                   0.776   Male
2916         21646  city_40                   0.776   Male
3636         10085  city_40                   0.776   Male
4251          2603  city_40                   0.776   Male
4346          4051  city_40                   0.776   Male
4526         11840  city_40                     NaN   Male
4588          7010  city_40                   0.776   Male
5156          7556  city_40                   0.776   Male
6330          5389  city_40                   0.776   Male
6483           484  city_40                   0.776   Male
6990         14681  city_40                   0.776   Male
7009          1221  city_40                   0.776   Male
8606         10244  city_40                   0.776   Male
8661          3200  city_40                   0.776   Male
8847         27287  city_40                   0.776   Male
9390         33101  city_40                   0.776   Male
9658         17972  city_40                   0.776   Male
10952        23316  city_40                   0.776   Male
11072        25420  city_40                   0.776   Male
11700        16999  city_40                   0.776   Male
12228        12801  city_40                   0.776   Male
12601         8663  city_40                   0.776   Male
12782        27144  city_40                   0.776   Male
13385         9845  city_40                   0.776   Male
13520        22956  city_40                   0.776   Male
14231         1047  city_40                   0.776   Male
14462         8565  city_40                   0.776   Male
15553        28032  city_40                   0.776   Male
16174        15617  city_40                   0.776   Male
17315        25444  city_40                   0.776   Male
17324        15257  city_40                   0.776   Male
17761        31883  city_40                   0.776   Male
17803        11634  city_40                   0.776   Male
17849        12243  city_40                   0.776   Male
18061        11208  city_40                   0.776   Male
18191          157  city_40                   0.776   Male
18650        26348  city_40                   0.776   Male
19142        13750  city_40                   0.776   Male

           relevent_experience enrolled_university education_level  \
1       No relevent experience       no_enrollment        Graduate
23     Has relevent experience       no_enrollment        Graduate
363    Has relevent experience    Part time course        Graduate
461    Has relevent experience    Full time course        Graduate
827    Has relevent experience       no_enrollment         Masters
998     No relevent experience    Full time course        Graduate
2916    No relevent experience    Full time course     High School
3636   Has relevent experience    Full time course        Graduate
4251   Has relevent experience       no_enrollment     High School
4346   Has relevent experience       no_enrollment        Graduate
4526   Has relevent experience    Full time course        Graduate
4588   Has relevent experience       no_enrollment        Graduate
5156    No relevent experience    Full time course        Graduate
6330   Has relevent experience       no_enrollment     High School
6483    No relevent experience    Full time course     High School
6990   Has relevent experience       no_enrollment     High School
7009   Has relevent experience       no_enrollment         Masters
8606   Has relevent experience       no_enrollment        Graduate
8661   Has relevent experience       no_enrollment        Graduate
8847   Has relevent experience       no_enrollment         Masters
9390   Has relevent experience       no_enrollment        Graduate
9658   Has relevent experience       no_enrollment         Masters
10952  Has relevent experience       no_enrollment        Graduate
11072  Has relevent experience       no_enrollment        Graduate
11700  Has relevent experience       no_enrollment        Graduate
12228  Has relevent experience    Part time course        Graduate
12601  Has relevent experience    Part time course        Graduate
12782  Has relevent experience       no_enrollment        Graduate
13385  Has relevent experience       no_enrollment         Masters
13520  Has relevent experience                 NaN        Graduate
14231  Has relevent experience       no_enrollment     High School
14462  Has relevent experience       no_enrollment         Masters
15553  Has relevent experience       no_enrollment        Graduate
16174  Has relevent experience       no_enrollment        Graduate
17315  Has relevent experience       no_enrollment         Masters
17324  Has relevent experience       no_enrollment        Graduate
17761  Has relevent experience    Part time course        Graduate
17803  Has relevent experience       no_enrollment        Graduate
17849   No relevent experience    Full time course        Graduate
18061   No relevent experience    Full time course        Graduate
18191  Has relevent experience    Full time course        Graduate
18650  Has relevent experience       no_enrollment     High School
19142  Has relevent experience       no_enrollment             NaN

      major_discipline  experience company_size         company_type  \
1                 STEM        15.0        50-99              Pvt Ltd
23          Humanities         0.0    1000-4999              Pvt Ltd
363               STEM        18.0      100-500       Funded Startup
461               STEM        14.0    1000-4999              Pvt Ltd
827               STEM         7.0       10000+              Pvt Ltd
998               STEM         9.0          NaN                  NaN
2916               NaN         5.0          NaN                  NaN
3636              STEM        10.0    1000-4999              Pvt Ltd
4251               NaN         3.0        50-99              Pvt Ltd
4346              STEM        20.0    1000-4999              Pvt Ltd
4526              STEM         3.0        50-99              Pvt Ltd
4588              STEM         5.0          <10              Pvt Ltd
5156              STEM         5.0          NaN                  NaN
6330               NaN         1.0        10/49              Pvt Ltd
6483               NaN         3.0          NaN              Pvt Ltd
6990               NaN        16.0      100-500       Funded Startup
7009              STEM        10.0    1000-4999              Pvt Ltd
8606             Other         4.0          <10              Pvt Ltd
8661        Humanities        20.0          NaN                  NaN
8847             Other        10.0          <10              Pvt Ltd
9390              STEM        10.0      500-999              Pvt Ltd
9658              STEM         6.0          <10              Pvt Ltd
10952             STEM        20.0        10/49              Pvt Ltd
11072             STEM        20.0          NaN                  NaN
11700         No Major         6.0          <10              Pvt Ltd
12228             STEM        20.0      100-500        Public Sector
12601             STEM        10.0        10/49              Pvt Ltd
12782             STEM        20.0          <10              Pvt Ltd
13385             STEM        15.0        50-99              Pvt Ltd
13520             STEM         5.0        50-99                  NaN
14231              NaN        19.0          NaN                  NaN
14462             STEM         7.0        50-99                  NaN
15553             STEM         4.0          NaN                  NaN
16174       Humanities        11.0        10/49              Pvt Ltd
17315             STEM        10.0      100-500              Pvt Ltd
17324             STEM        20.0          NaN                  NaN
17761             STEM         5.0        50-99              Pvt Ltd
17803             STEM         4.0        10/49              Pvt Ltd
17849             STEM         7.0          NaN                  NaN
18061             STEM         0.0          NaN                  NaN
18191             STEM         5.0       10000+              Pvt Ltd
18650              NaN        13.0        50-99              Pvt Ltd
19142              NaN         5.0        10/49  Early Stage Startup

       training_hours  target
1                47.0     0.0
23               65.0     0.0
363              51.0     0.0
461              52.0     0.0
827              56.0     0.0
998              50.0     0.0
2916             56.0     1.0
3636            104.0     0.0
4251             28.0     0.0
4346             20.0     0.0
4526              9.0     0.0
4588              4.0     0.0
5156            330.0     0.0
6330             89.0     0.0
6483             22.0     0.0
6990             76.0     0.0
7009             32.0     0.0
8606            108.0     0.0
8661             29.0     0.0
8847             35.0     0.0
9390             32.0     0.0
9658             54.0     0.0
10952            15.0     0.0
11072            22.0     0.0
11700           144.0     0.0
12228            89.0     0.0
12601            13.0     0.0
12782            58.0     0.0
13385            78.0     0.0
13520            98.0     0.0
14231            72.0     0.0
14462            25.0     1.0
15553            89.0     1.0
16174            50.0     0.0
17315            22.0     0.0
17324            90.0     0.0
17761            98.0     0.0
17803            61.0     0.0
17849             1.0     0.0
18061           127.0     1.0
18191            42.0     0.0
18650            10.0     0.0
19142            26.0     0.0

### Step 5

### Data Cleaning & Handling Missing Values in Pandas

### Checking for Missing Values

In [181]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, None, 35, 40],  
    'City': ['New York', 'Los Angeles', None, 'Chicago'],  
    'Salary': [50000, 60000, 70000, None]  
}

df = pd.DataFrame(data)

print(df.isnull())

    Name    Age   City  Salary
0  False  False  False   False
1  False   True  False   False
2  False  False   True   False
3  False  False  False    True

### Count Missing Values Per Column

In [182]:
print(df.isnull().sum())

Name      0
Age       1
City      1
Salary    1
dtype: int64

### Fill Missing Values with a Specific Value

In [184]:
df_filled = df.fillna(0)
print(df_filled)

      Name   Age         City   Salary
0    Alice  25.0     New York  50000.0
1      Bob   0.0  Los Angeles  60000.0
2  Charlie  35.0            0  70000.0
3    David  40.0      Chicago      0.0

### Fill Missing Values with Column Mean (for Numerical Data)

In [185]:
df['Age'].fillna(df['Age'].mean(), inplace=True) 
df['Salary'].fillna(df['Salary'].median(), inplace=True)

C:\Users\msi\AppData\Local\Temp\ipykernel_8152\89747827.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace=True)
C:\Users\msi\AppData\Local\Temp\ipykernel_8152\89747827.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].median(), inplace=True)

### Fill Missing Values with Mode (Most Frequent Value)

In [186]:
df['City'].fillna(df['City'].mode()[0], inplace=True)

C:\Users\msi\AppData\Local\Temp\ipykernel_8152\1488218936.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['City'].fillna(df['City'].mode()[0], inplace=True)

### Forward Fill (ffill)
Fills missing values with the previous row’s value.

In [187]:
df.fillna(method='ffill', inplace=True)

C:\Users\msi\AppData\Local\Temp\ipykernel_8152\3970806690.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', inplace=True)

### Backward Fill (bfill)
Fills missing values with the next row’s value.

In [188]:
df.fillna(method='bfill', inplace=True)

C:\Users\msi\AppData\Local\Temp\ipykernel_8152\3314729575.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill', inplace=True)

In [189]:
print(df.isnull().sum())

Name      0
Age       0
City      0
Salary    0
dtype: int64

### Dropping Missing Values (df.dropna())

### Drop Rows with Missing Values

In [191]:
df_dropped = df.dropna()
print(df_dropped)

      Name        Age         City   Salary
0    Alice  25.000000     New York  50000.0
1      Bob  33.333333  Los Angeles  60000.0
2  Charlie  35.000000      Chicago  70000.0
3    David  40.000000      Chicago  60000.0

### Drop Columns with Missing Values

In [192]:
df_dropped_cols = df.dropna(axis=1)
print(df_dropped_cols)

      Name        Age         City   Salary
0    Alice  25.000000     New York  50000.0
1      Bob  33.333333  Los Angeles  60000.0
2  Charlie  35.000000      Chicago  70000.0
3    David  40.000000      Chicago  60000.0

### Drop Rows Only if All Values are Missing

In [193]:
df.dropna(how='all', inplace=True)

### Drop Rows if a Specific Column has Missing Values

In [194]:
df.dropna(subset=['Age'], inplace=True)

In [195]:
print(df.head())

      Name        Age         City   Salary
0    Alice  25.000000     New York  50000.0
1      Bob  33.333333  Los Angeles  60000.0
2  Charlie  35.000000      Chicago  70000.0
3    David  40.000000      Chicago  60000.0

### Now let's go to learn Cleaning & Handling Missing Values in Pandas with realy data

In [197]:
df = pd.read_csv('data.csv')

print(df.head())

   enrollee_id      city  city_development_index gender  \
0         8949  city_103                   0.920   Male
1        29725   city_40                   0.776   Male
2        11561   city_21                   0.624    NaN
3        33241  city_115                   0.789    NaN
4          666  city_162                   0.767   Male

       relevent_experience enrolled_university education_level  \
0  Has relevent experience       no_enrollment        Graduate
1   No relevent experience       no_enrollment        Graduate
2   No relevent experience    Full time course        Graduate
3   No relevent experience                 NaN        Graduate
4  Has relevent experience       no_enrollment         Masters

  major_discipline  experience company_size    company_type  training_hours  \
0             STEM        20.0          NaN             NaN            36.0
1             STEM        15.0        50-99         Pvt Ltd            47.0
2             STEM         5.0          NaN             NaN            83.0
3  Business Degree         0.0          NaN         Pvt Ltd            52.0
4             STEM        20.0        50-99  Funded Startup             8.0

   target
0     1.0
1     0.0
2     0.0
3     1.0
4     0.0

### Learn more about data type

In [171]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             19158 non-null  int64
 1   city                    19158 non-null  object
 2   city_development_index  18679 non-null  float64
 3   gender                  14650 non-null  object
 4   relevent_experience     19158 non-null  object
 5   enrolled_university     18772 non-null  object
 6   education_level         18698 non-null  object
 7   major_discipline        16345 non-null  object
 8   experience              19093 non-null  float64
 9   company_size            13220 non-null  object
 10  company_type            13018 non-null  object
 11  training_hours          18392 non-null  float64
 12  target                  19158 non-null  float64
dtypes: float64(4), int64(1), object(8)
memory usage: 1.9+ MB
None

### we have - dtypes: float64(4), int64(1), object(8)

### Check for missing values

In [172]:
print(df.isnull().sum())

enrollee_id                  0
city                         0
city_development_index     479
gender                    4508
relevent_experience          0
enrolled_university        386
education_level            460
major_discipline          2813
experience                  65
company_size              5938
company_type              6140
training_hours             766
target                       0
dtype: int64

### Check percentage of missing values

In [174]:
missing_percenttage = (df.isnull().sum() / len(df)) * 100
print(missing_percenttage)

enrollee_id                0.000000
city                       0.000000
city_development_index     2.500261
gender                    23.530640
relevent_experience        0.000000
enrolled_university        2.014824
education_level            2.401086
major_discipline          14.683161
experience                 0.339284
company_size              30.994885
company_type              32.049274
training_hours             3.998330
target                     0.000000
dtype: float64

# 📌 Handling Missing Values Guide

| **Data Type** | **Missing Percentage** | **Best Handling Method** | **When to Use This Method?** |
|--------------|-----------------|----------------------|------------------|
| **🔹 Numerical Data (`int64`, `float64`)** | **Less than 5%**  | `mean()` or `median()` | If the impact is minimal |
| | **5% - 30%** | `median()` if outliers exist, `mean()` if normally distributed | When the missing percentage is moderate |
| | **More than 30%** | `median()` if the column is important; otherwise, drop it | If the remaining values are sufficient |
| | **More than 50%** | Drop the column | When the remaining values are too few |
| **🔹 Categorical Data (`object`)** | **Less than 5%**  | `mode()` (most frequent value) | If the impact is minimal |
| | **5% - 30%** | `mode()` or `ffill()` / `bfill()` | If the data has a logical sequence |
| | **More than 30%** | `mode()` if the column is important; otherwise, drop it | If the remaining values are sufficient |
| | **More than 50%** | Drop the column | If the missing data is too significant |
| **🔹 Date/Time Data (`datetime64`)** | **Less than 5%**  | `ffill()` or `bfill()` | If there is a chronological order |
| | **5% - 30%** | `interpolate()` or `bfill()` | If time continuity is important |
| | **More than 30%** | `interpolate()` or drop missing rows | If sufficient data remains |
| | **More than 50%** | Drop the column or remove missing data | If the data is no longer meaningful |
| **🔹 Categorical (Ordinal) Data** | **Less than 5%**  | `mode()` | If categories are stable |
| | **5% - 30%** | `mode()` or `ffill()` | If the category can be inferred |
| | **More than 30%** | `mode()` if the column is important; otherwise, drop it | If the remaining values are sufficient |
| | **More than 50%** | Drop the column | If too much data is lost |

In [202]:
df['city_development_index'].fillna(df['city_development_index'].mean() , inplace=True)
df['experience'].fillna(df['experience'].mean() , inplace = True)
df['training_hours'].fillna(df['training_hours'].mean() , inplace=True)

C:\Users\msi\AppData\Local\Temp\ipykernel_8152\2041762407.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['city_development_index'].fillna(df['city_development_index'].mean() , inplace=True)
C:\Users\msi\AppData\Local\Temp\ipykernel_8152\2041762407.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['experience'].fillna(df['experience'].mean() , inplace = True)
C:\Users\msi\AppData\Local\Temp\ipykernel_8152\2041762407.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['training_hours'].fillna(df['training_hours'].mean() , inplace=True)

In [204]:
categorical_cols = ['gender', 'enrolled_university', 'education_level', 'major_discipline', 'company_size', 'company_type']

for col in categorical_cols:
    df[col].fillna(df[col].mode()[0] , inplace = True)

### Check for missing values

In [205]:
print(df.isnull().sum())

enrollee_id               0
city                      0
city_development_index    0
gender                    0
relevent_experience       0
enrolled_university       0
education_level           0
major_discipline          0
experience                0
company_size              0
company_type              0
training_hours            0
target                    0
dtype: int64

### We save the new cleaned data

In [206]:
df.to_csv('cleaned_data.csv', index=False)